In [2]:
import numpy as np
import pandas as pd

#### sorting by row or index

### Series

In [4]:
zzz = pd.Series(range(4), index=['d','a','b','c'])
zzz.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [14]:
zzz2 = pd.Series([1,2,-3,4])
zzz2

0    1
1    2
2   -3
3    4
dtype: int64

In [15]:
zzz2.sort_values()

2   -3
0    1
1    2
3    4
dtype: int64

### DataFrame

In [5]:
zzzframe = pd.DataFrame(np.arange(8).reshape((2,4)),
index=['z','x'], columns=['d','a','b','c'])
zzzframe.sort_index()

   d  a  b  c
x  4  5  6  7
z  0  1  2  3

In [6]:
zzzframe.sort_index(axis=1)

   a  b  c  d
z  1  2  3  0
x  5  6  7  4

In [7]:
zzzframe.sort_index(axis=0)

   d  a  b  c
x  4  5  6  7
z  0  1  2  3

### Reverse ascending

In [8]:
zzzframe.sort_index(axis=1, ascending=False)

   d  c  b  a
z  0  3  2  1
x  4  7  6  5

In [17]:
zzzframe2 = pd.DataFrame({'b':[4,5,-2,2], 'a':[0,1,0,1]})
zzzframe2

   b  a
0  4  0
1  5  1
2 -2  0
3  2  1

In [18]:
zzzframe2.sort_values(by='b')

   b  a
2 -2  0
3  2  1
0  4  0
1  5  1

In [19]:
zzzframe2.sort_values(by='a')

   b  a
0  4  0
2 -2  0
1  5  1
3  2  1

In [20]:
zzzframe2.sort_values(by=['a','b'])

   b  a
2 -2  0
0  4  0
3  2  1
1  5  1

### Ranking
#### Ranking assigns ranks from one through the number of valid data points in an array. The rank methods for Series and DataFrame are the place to look; by default rank breaks ties by assigning each group the mean rank

In [21]:
zzz = pd.Series([7, -5, 7, 4, 2, 0, 4])
zzz

0    7
1   -5
2    7
3    4
4    2
5    0
6    4
dtype: int64

In [22]:
zzz.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [23]:
zzz.rank(method='first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [24]:
zzz.rank(ascending='False', method='max')

0    7.0
1    1.0
2    7.0
3    5.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [27]:
zframe = pd.DataFrame({'b':[4.3,7,-3,2], 'a':[0,1,0,1], 'c':[-2,5,8,-2.5]})
zframe

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [28]:
zframe.rank(axis='columns')

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

### Axis Indexes with Duplicate Labels

In [30]:
zzz = pd.Series(range(5), index=['a','a','a','b','c'])
zzz

a    0
a    1
a    2
b    3
c    4
dtype: int64

In [31]:
zzz.index.is_unique

False

In [32]:
zzz['a']

a    0
a    1
a    2
dtype: int64

In [33]:
zzz['c']

4

###  indexing rows in a DataFrame

In [34]:
zdf = pd.DataFrame(np.random.randn(4,3),index=['a','a','b','b'])

In [35]:
zdf

          0         1         2
a  0.404910 -2.446296 -0.743425
a  0.189607 -1.567507  0.198878
b  0.535426 -1.037029 -1.301824
b -1.365650 -0.797879  0.482919

In [37]:
zdf.loc['b']

          0         1         2
b  0.535426 -1.037029 -1.301824
b -1.365650 -0.797879  0.482919